# Pandas

## Task 1

You should import the necessary libraries. You will use `numpy` and `pandas` libraries.


> Don't forget to import `numpy`, and `pandas` in short form.

In [12]:
import numpy as np
import pandas as pd

## Task 2

Create a `DataFrame` from the given dictionary `data`.

In [7]:
data = {
    "Name": ["John", "Emily", "Ryan"],
    "Age": [16, 28, 22],
    "City": ["New York", "Los Angeles", "Chicago"],
}

my_df = pd.DataFrame({
    "Name": ["John", "Emily", "Ryan"],
    "Age": [16, 28, 22],
    "City": ["New York", "Los Angeles", "Chicago"],
})
my_df

    Name  Age         City
0   John   16     New York
1  Emily   28  Los Angeles
2   Ryan   22      Chicago

## Task 3

In this task you should complete the following steps:

### Task 3.1
Display all data for `Age` column for the DataFrame you created in the previous task.

In [18]:
my_df["Age"]

0    16
1    28
2    22
Name: Age, dtype: int64

### Task 3.2

Add `Salary` column to the `DataFrame` with the values `[50000, 60000, 45000]`.

In [17]:
salary = pd.Series([50000, 60000, 45000], name="Salary")
my_df["Salary"] = salary
my_df

,Name,Age,City,Salary,Birth year,Average Age,Absolute difference
0,John,16,New York,50000,2008,22.0,6.0
1,Emily,28,Los Angeles,60000,1996,22.0,6.0
2,Ryan,22,Chicago,45000,2002,22.0,0.0

### Task 3.3

Filter the `DataFrame` to show only the rows with the `Age` greater than 18.

In [10]:
my_df[my_df["Age"] > 18]

    Name  Age         City  Salary
1  Emily   28  Los Angeles   60000
2   Ryan   22      Chicago   45000

## Task 4

In this task you should complete the following steps:

### Task 4.1

Add new calculated field `Birth year`;

In [19]:
my_df["Birth year"] = 2024 - my_df["Age"]
my_df

,Name,Age,City,Salary,Birth year,Average Age,Absolute difference
0,John,16,New York,50000,2008,22.0,6.0
1,Emily,28,Los Angeles,60000,1996,22.0,6.0
2,Ryan,22,Chicago,45000,2002,22.0,0.0

### Task 4.2

Add new calculated field `Average age`.

In [20]:
my_df["Average Age"] = my_df["Age"].mean()
my_df

,Name,Age,City,Salary,Birth year,Average Age,Absolute difference
0,John,16,New York,50000,2008,22.0,6.0
1,Emily,28,Los Angeles,60000,1996,22.0,6.0
2,Ryan,22,Chicago,45000,2002,22.0,0.0

### Task 4.3

Calculate absolute difference between `Age` and `Average age`.

In [21]:
my_df["Absolute difference"] = abs(my_df["Age"] - my_df["Average Age"])
my_df

,Name,Age,City,Salary,Birth year,Average Age,Absolute difference
0,John,16,New York,50000,2008,22.0,6.0
1,Emily,28,Los Angeles,60000,1996,22.0,6.0
2,Ryan,22,Chicago,45000,2002,22.0,0.0

## Task 5

Complete the following tasks described below.

### Task 5.1

You have two dictionaries `data1` and `data2`. Create two `DataFrame` objects from these dictionaries. Then, `concatenate`, and `merge` these two `DataFrame` objects into one `DataFrame` object, and see the difference.

In [22]:
# Data
data1 = {'Name': ['John', 'Emily', 'Ryan'],
         'Age': [25, 28, 22]}
data2 = {'Name': ['Emily', 'Ryan', 'Mike'],
         'City': ['Los Angeles', 'Chicago', 'Houston']}

In [16]:
new_df_1 = pd.DataFrame({
    "Name": ["John", "Emily", "Ryan"],
    "Age": [25, 28, 22]
})
new_df_2 = pd.DataFrame({
    "Name": ["Emily", "Ryan", "Mike"],
    "City": ["Los Angeles", "Chicago", "Houston"]
})

merged_df = pd.merge(new_df_1, new_df_2)
merged_df

    Name  Age         City
0  Emily   28  Los Angeles
1   Ryan   22      Chicago

In [24]:
"""
Conclusion: If we megre all dataframes, we will have only that columns and strings, which existing in all dataframes (something similar to SQL).
"""

'\nConclusion: If we megre all dataframes, we will have only that columns and strings, which existing in all dataframes (something similar to SQL).\n'

In [22]:
combined_df = pd.concat([merged_df, my_df])
combined_df

,Name,Age,City,Salary,Birth year,Average Age,Absolute difference
0,Emily,28,Los Angeles,NaN,NaN,NaN,NaN
1,Ryan,22,Chicago,NaN,NaN,NaN,NaN
0,John,16,New York,50000.0,2008.0,22.0,6.0
1,Emily,28,Los Angeles,60000.0,1996.0,22.0,6.0
2,Ryan,22,Chicago,45000.0,2002.0,22.0,0.0

In [23]:
"""
Conclusion: If we concatenate all dataframes, we will have all columns and strings from all dataframes, and those that do not have enough values are filled with the value 'NaN'.
"""

"\nConclusion: If we concatenate all dataframes, we will have all columns and strings from all dataframes, and those that do not have enough values are filled with the value 'NaN'.\n"

### Task 5.2

You have two `Series` objects `s1` and `s2`. Make default mathematical operations on these two `Series` objects. Such as `+`, `-`, `*`, `/`, `**`, `//`, `%`. Also, filter `s1` and print only even numbers, and `s2` only with odd numbers.

In [ ]:
s1 = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([6, 7, 8, 9, 10])

In [26]:
s1 = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([6, 7, 8, 9, 10])

s1_plus_s2 = s1 + s2
s1_plus_s2

0     7
1     9
2    11
3    13
4    15
dtype: int64

In [27]:
s1_minus_s2 = s1 - s2
s1_minus_s2

0   -5
1   -5
2   -5
3   -5
4   -5
dtype: int64

In [28]:
s1_product_s2 = s1 * s2
s1_product_s2

0     6
1    14
2    24
3    36
4    50
dtype: int64

In [29]:
s1_divide_s2 = s1 / s2
s1_divide_s2

0    0.166667
1    0.285714
2    0.375000
3    0.444444
4    0.500000
dtype: float64

In [30]:
s1_exponent_s2 = s1 ** s2
s1_exponent_s2

0          1
1        128
2       6561
3     262144
4    9765625
dtype: int64

In [31]:
s1_divide_without_remainder_s2 = s1 // s2
s1_divide_without_remainder_s2

0    0
1    0
2    0
3    0
4    0
dtype: int64

In [32]:
s1_modulus_s2 = s1 % s2
s1_modulus_s2

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [33]:
s1 = s1[s1 % 2 == 0]
s1

1    2
3    4
dtype: int64

In [34]:
s2 = s2[s2 % 2 != 0]
s2

1    7
3    9
dtype: int64

### Task 5.3

You have a `Serias` object `s`. Make the following operations on this `Series` object:

* make all words in uppercase without loops;
* get length of each word without loops.

In [35]:
s = pd.Series(["numpy", "pandas", "matplotlib"])

In [36]:
s = pd.Series(["numpy", "pandas", "matplotlib"], name="Uppercase")
s_upper = s.str.upper()
s_upper

0         NUMPY
1        PANDAS
2    MATPLOTLIB
Name: Uppercase, dtype: object

In [37]:
s = pd.Series(["numpy", "pandas", "matplotlib"], name="Length")
s_lenght = s.str.len()
s_lenght

0     5
1     6
2    10
Name: Length, dtype: int64

## Task 6 Optional

You have a large dataset consisting of a series of numbers. Your task is to calculate the moving average of the series using a window of `5` elements. The moving average is the average of a set of consecutive values in the series, where the window `slides` through the series to compute the average at each position. The goal is to calculate the moving average efficiently and accurately. Also, compare time performance of Python and Pandas solutions.

> Please, note: If you get `nan` while calculating the moving average, you should remove it from the result. Pandas solution should take 1-2 lines of code.

### Python Solution

In the Python solution, a large dataset is generated using random numbers. The moving average is computed by iterating over the dataset using a loop. At each position, a window of 5 elements is created, and the average is calculated by summing the values in the window and dividing by 5.

In [62]:
import random

def unknown_signature():
    # Generate a large dataset
    data = [random.randint(1, 100) for _ in range(10000000)]

    # Calculate the moving average with a window of 5
    moving_averages = []
    for i in range(4, len(data)):
        window = data[i - 4 : i + 1]
        average = sum(window) / 5
        moving_averages.append(average)
    return moving_averages[:10]

%time unknown_signature()

CPU times: total: 656 ms
Wall time: 4.5 s

[37.8, 51.4, 53.4, 45.8, 42.4, 44.2, 36.8, 39.4, 44.8, 51.4]

### Solution using Pandas and Numpy

In [39]:
import random
import numpy as np
import pandas as pd


def unknown_signature_pandas():
    """
    For faster performance we use here:
    1. np.random.randint for generating large random dataset of numbers
    2. rolling(window=5) method to calculate the moving average over a window of 5 elements.
    3. mean() function to calculate average each window.
    4. dropna() function to drop rows with NaN values.
    5. to_numpy() function to convert the data into a NumPy array.
    """
    data_pandas = np.random.randint(1, 100, size=10000)
    
    moving_averages_pandas = pd.Series(data_pandas).rolling(window=5).mean().dropna()
    
    convert_to_array = moving_averages_pandas.to_numpy()
    
    return convert_to_array[:10]


%time unknown_signature_pandas()

CPU times: total: 0 ns
Wall time: 0 ns

array([42.2, 41.4, 41. , 31.6, 35. , 38.4, 44.4, 60.6, 54.8, 58.2])